# Примеры решения переборных задач в PyCharm
# Текст задания
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
## Пример 1
```
n = (int(input()))
r = bin(n)
print(r)
```
что выведет эта программа:
```
41
0b101001
```
## Пример 2
```
n = (int(input()))
r = bin(n)[2:]
print(r)
```
что выведет эта программа:
```
32
100000
10000001
```
## Пример 3
```
n = (int(input()))
r = bin(n)[2:]
print(r)
if n % 2 == 0:
    r += '01'
else:
    r += '10'
print(r)
```
что выведет эта программа:
```
29
1110110
```
## Пример 4
```
for n in range(1,100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    print(n, r)
```
что выведет эта программа:
```
1 110
2 1001
3 1110
...
98 110001001
99 110001110
```
## Пример 5
```
for n in range(1,100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    print(n, int(r))
```
что выведет эта программа:
```
1 110
2 1001
3 1110
4 10001
5 10110
...
97 110000110
98 110001001
99 110001110
```
## Пример 6
```
for n in range(1,100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    print(n, int(r, 2))
```
что выведет эта программа:
```
1 6
2 9
3 14
4 17
5 22
6 25
7 30
...
98 393
99 398
```
## Пример 7
```
for n in range(1,100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    if int(r, 2) > 130:
        print(int(r, 2))
```
что выведет эта программа:
```
134
137
142
145
150
153
158
161
166
169
174
177
182
185
190
193
198
201
206
209
214
217
222
225
230
233
238
241
246
249
254
257
262
265
270
273
278
281
286
289
294
297
302
305
310
313
318
321
326
329
334
337
342
345
350
353
358
361
366
369
374
377
382
385
390
393
398
```
## Пример 8
```
n = int(input())
r = bin(n) [2:]
if r.count('1') % 2 == 0:
    r += '0'
else:
    r += '1'
    print(r)
if r.count('1') % 2 == 0:
    r += '0'
else:
    r += '1'
    print(r)
```
что выведет эта программа:
```
50
1100101  
```
